Revit 2027 API
FaceBasedPlacementType Enumeration
 This enumerated type specifies options available for placement of a face-based family instance.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FaceBasedPlacementType
Public Enumeration FaceBasedPlacementType
public enum class FaceBasedPlacementType
type FaceBasedPlacementType
Members
Member name | Value | Description
Default | 0 |  Placement the instance which is not face-based.
PlaceOnFace | 2 |  Placement on a selected face from existing geometry.
PlaceOnVerticalFace | 1 |  Placement on a vertical face.
PlaceOnWorkPlane | 3 |  Placement on current workplane.
See Also
Reference
Autodesk.Revit.UI Namespace